export const agreement = `本应用尊重并保护所有使用服务用户的个人隐私权。为了给您提供更有个性化、更准确的服务，本应用会按照本协议与隐私条款的规定使用和披露您的个人信息。但本应用将以高度的勤勉、审慎义务对待这些信息。除用户协议与隐私条款另有规定外，在未征得您事先许可的情况下，本应用不会将这些信息对外披露或向第三方提供。

            您在同意本应用服务使用协议之时，即视为您已经同意本协议与隐私条款的全部内容。本协议与隐私条款属于本应用服务使用协议不可分割的一部分。
            
            一、概述

            1、用户协议（以下称"本协议"）与隐私条款为重庆月下童信息科技有限公司（以下称“本公司”）与本公司提供的社交平台（Youla）服务（以下称“Youla服务”）的使用人（以下称“用户”）之间的协议和隐私条款。

            2、本公司在此特别声明，用户欲要使用Youla服务，必须事先认真阅读本协议与隐私条款中各条款（未成年人禁止使用本公司提供的任何服务与应用），包括免除或者限制本公司责任的免责条款及对用户的权利限制。

            3、用户注册、登录、使用及连接等行为将视为用户完全了解并接受及遵守本协议与隐私条款项下的全部条款内容，本协议与隐私条款可由本公司随时修改，修改后的协议条款不做例行通知，将代替原来的协议与隐私条款，用户可在“Youla”查阅最新版协议与隐私条款。如果用户不接受修改后的协议与隐私条款，请立即停止使用Youla提供的服务，如继续使用Youla的服务，视为用户接受修改。

            二、用户隐私条款

            1、隐私信息包括下列信息：用户昵称、性别、照片、出生日期、IP地址、身份证信息等用户个人隐私信息。而非个人隐私信息是指用户对本服务的操作状态以及使用习惯等一些明确且客观反映在本公司服务器端的基本记录信息和其他一切个人隐私信息范围外的普通信息；

            2、“Youla”账号的所有权归本公司所有，用户完成申请注册手续后，获得“Youla”账号的使用权，该使用权仅属于初始申请注册人，禁止赠与、借用、租用、转让或售卖。本公司因经营需要，有权回收用户的“Youla”账号。

            3、用户在享用本公司提供的社交平台（Youla）的各项服务的同时，同意接受本公司提供的各类信息服务。用户同意，本公司有权随时变更、中断或终止部分或全部的“Youla”服务，本公司无需通知用户，且本公司不对用户或第三方承担任何责任。

            4、如用户停止使用本服务或本服务终止，本公司可以从服务器上永久地删除用户的数据。本服务停止、终止后，本公司没有义务向用户返还任何数据。

            三、隐私保护

            本公司将按照行业规范保护用户的信息，对用户采集的个人隐私信息，不对外公开或向第三方提供单个/任何用户的个人隐私信息（指能够对用户进行个人辨识或涉及个人通信的信息，包括但不限于下列信息：用户昵称、性别、出生日期、照片、IP地址、身份证信息），但下列情况除外，同时用户应自行承担因此可能产生的任何风险，本公司对此不予负责：

            （1）事先获得用户的明确授权；

            （2）由于用户将其用户密码告知他人或与他人共享注册账户与密码，由此导致的任何个人信息的泄露，或其他非因Youla软件原因导致的个人隐私信息的泄露；

            （3）用户自行向第三方公开其个人隐私信息；

            （4）为了维护公众以及本公司的合法利益；

            （5）本公司可能会与第三方合作，向用户提供相关的网络服务，在此情况下，如该第三方同意承担与本公司同等的保护用户隐私的责任，则本公司有权将用户的注册资料等提供给该第三方；

            （6）任何由于黑客攻击、电脑病毒侵入及其他不可抗力事件导致用户个人隐私信息的泄露；

            （7）本公司内部进行审计、数据分析和研究等，以改进Youla软件的服务和与用户之间的沟通；

            （8）依本协议约定，本公司管理、审查用户信息及进行处理措施；

            （9）根据有关的法律法规规定或有关行政机关、司法机关要求提供用户个人隐私信息的；

            （10）按照相关政府主管部门、司法机关的要求。

            四、内容规范

            1、本条所述“内容”是指用户使用本服务过程中所制作、上载、复制、发布、传播的任何内容，包括但不限于账号头像、名称、用户说明等注册信息及认证资料，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用账号或本服务所产生的内容。

            2、用户不得利用“Youla”账号或Youla提供的服务制作、上载、复制、发布、传播如下法律、法规和政策禁止的内容：
            (1) 反对宪法所确定的基本原则的；
            (2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
            (3) 损害国家荣誉和利益的；
            (4) 煽动民族仇恨、民族歧视，破坏民族团结的；
            (5) 破坏国家宗教政策，宣扬邪教和封建迷信的；
            (6) 散布谣言，扰乱社会秩序，破坏社会稳定的；
            (7) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
            (8) 侮辱或者诽谤他人，侵害他人合法权益的
            (9) 不遵守法律法规底线、社会主义制度底线、国家利益底线、公民合法权益底线、社会公共秩序底线、道德风尚底线和信息真实性底线的“七条底线”要求的；
            (10) 含有法律、行政法规禁止的其他内容的信息

            3、用户不得利用“Youla”账号或本服务制作、上载、复制、发布、传播如下干扰“Youla”正常运营，以及侵犯其他用户或第三方合法权益的内容：
            (1) 含有任何性或性暗示的；
            (2) 含有辱骂、恐吓、威胁内容的；
            (3) 含有骚扰、垃圾广告、虚假信息、恶意信息、诱骗信息、欺诈信息的；
            (4) 涉及他人隐私、个人信息或资料的；
            (5) 侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；
            (6) 含有任何损害Youla软件或本公司名誉等的；
           （7）含有其他干扰本服务正常运营和侵犯其他用户或第三方合法权益内容的信息。

            五、Youla使用规则

            1、用户在登录Youla或通过Youla服务所传送、发布的任何内容并不反映或代表，也不得被视为反映或代表本公司或Youla软件的观点、立场或政策，本公司对此不承担任何责任。

            2、用户登录Youla以使用Youla服务，用户应当对以其帐号进行的所有活动和事件承担法律责任，用户知晓并明确对其提交的任何信息以及因该等信息导致其使用Youla的服务所有的风险完全由用户自己承担。

            3、用户在使用Youla服务过程中，必须遵循以下原则：
            （1）遵守中国有关的法律和法规（不时修改）；
            （2）遵守所有与网络服务有关的网络协议、规定和程序；
            （3）不得为任何非法目的而使用Youla服务；
            （4）不得以任何形式利用Youla服务干扰Youla软件正常运营或侵犯本公司的权利和/或利益；
            （5）不得利用Youla服务进行任何可能对互联网正常运转造成不利影响的行为；
            （6）不得利用本公司或Youla软件提供的服务上传、展示或传播任何虚假的、骚扰性的、欺诈性的、中伤他人的、种族歧视性的、辱骂性的、恐吓性的、情色的、具有情色诱导性字眼的、推销广告性的或其他任何非法的信息资料（包括但不限于语音、文字、图片等形式）；
            （7）不得利用Youla服务侵犯其他用户的合法权益，不得强制、诱导、欺骗其他用户关注或分享信息等；
            （8）不得利用技术手段批量建立虚假账号；
            （9）不得在使用Youla服务过程中，进行虚假或违规充值、提取红包等非法套现；
            （10）不得利用Youla服务，进行违法违规交易；
            （11）不得以任何方式侵犯其他任何人依法享有的专利权、著作权、商标权、名誉权或其他任何合法权益。
            （12）不得利用Youla服务，从事人身攻击、语言暴力等行为；不得利用Youla平台传播第三方导流信息；不得在Youla平台进行恶意举报、恶意投票等恶意扰乱平台内用户使用秩序的行为。
            （13）不得危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一；不得煽动民族仇恨、民族歧视，破坏民族团结；不得破坏国家宗教政策，宣扬邪教和封建迷信；不得散布谣言，扰乱社会秩序，破坏社会稳定；

            4、本公司有权对用户使用Youla服务的情况进行审查和监督，如用户在使用Youla服务时违反任何上述规定，本公司有权要求用户改正或直接采取一切必要的措施以消除或减轻用户不当行为造成的影响，本公司在进行前述操作前，操作过程中或操作完成后可以不对用户进行任何方式的通知。

            5、您充分理解并同意：因业务发展需要、突发情势等，本产品可能会临时变更、暂停、限制或者终止本产品或全部服务，或变更、删除、转移您存储、发布在“Youla”产品/服务中的内容（包括但不限于账号头像、名称、ID、用户说明等注册信息及认证资料，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及等级信息、虚拟装扮、会员服务等其他使用账号或本服务所产生的内容），公司将努力但不保证能做到事先通知，我们采取上述行为对您和任何第三方均不承担违约责任。您理解并同意，我们终止向您提供“Youla”产品/服务后，您将不能登录、查阅账号信息，我们将停止收集使用您的个人信息、已经收集的您的信息将被删除，其他已有的数据经匿名化处理后可继续由我们保存。我们向您终止提供“Youla”产品与服务，不影响在服务终止前您对我们及任何第三方所负的违约或任何形式责任的效力。

            六、处罚规则及法律责任

            如果本公司发现或收到他人举报或投诉用户违反本协议约定的，以及本公司接到相关行政机关、司法机关等部门通知，认为用户违反相关法律法规的，本公司将会在24小时内进行处理，同时本公司有权不经通知随时对相关内容，包括但不限于用户资料、发布内容等进行审查、删除，并视情节轻重对违规账号处以包括但不限于警告、账号封禁 、设备封禁 、功能封禁的处罚，且通知用户处理结果，具体分处罚规则：
            （1）警告：即对违规用户进行警告；
            （2）封号：即封闭违规用户的账号；
            （3）封停设备：即删除违规用户的登录设备；
            （4）封禁规则：当天被不同账号举报3次及以上发出警告1次；累计超过3次警告，作封禁处理；违反Youla使用规则或违反相关法律法规使用Youla的，将直接进行封禁处理；

            七、会员服务协议

            1、本公司将在“Youla”平台实行用户vip会员制。用户可充值vip成为会员身份，Youla vip会员可享受“Youla”平台的vip特权，具体价格信息与vip特权将由本公司自行决定并在相关服务页面上显示。

            2、Youla vip充值时，用户需要选择vip充值周期，充值成功后享受会员vip服务，服务时间到有效周期满后，vip会员身份将会失效，若当前用户已是vip会员，用户充值后，vip服务时间将会截止在当前有效服务期截止时间上叠加充值周期时间。

            3、Youla vip充值周期分为：7天、1个月、3个月、半年、一年、终身，本公司有权更改充值周期以及周期价格，并在相关页面展示更改信息，已经购买的vip会员不受此影响。

            4、用户可以通过iOS内购、微信或其他“Youla”平台提供的充值途径为Youla账户进行充值。

            5、用户确认，Youla账户一经充值成功。除法律法规明确规定外，Youla账户充值完成后，本公司不予退款。

            6、用户确认，用户充值完vip会员后5分钟内服务到账，因网络等其他原因延迟的，请等候3～5分钟后重新查看或重启Youla平台app查看，若仍未到账或无法使用，请联系客服。

            7、用户确认，除法律法规明确规定或本协议另有约定外，用户已购买的任何收费服务不能以任何理由退购或调换成其他服务。

            八、免责与赔偿声明

            1、本公司提供的服务信息仅供用户参考，用户应对本公司提供信息自行加以判断，并承担因使用信息而引起的所有风险，包括因对信息的正确性、完整性或实用性的依赖而产生的风险。本公司无需对因用户行为而导致的任何损失或损害承担责任。

            2、在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，本公司将努力在第一时间与相关单位配合，以及及时修复，但是由此给用户或第三方造成的损失，本公司及合作第三方无需对此承担责任。

            3、本服务同大多数互联网服务一样，受包括但不限于用户原因、网络服务质量、社会环境等因素的差异影响，可能受到各种安全问题的侵扰，如他人利用用户的资料，造成现实生活中的骚扰；用户下载安装的其它软件或访问的其他网站中含有“特洛伊木马”等病毒，威胁到用户的计算机信息和数据的安全，继而影响本服务的正常使用等等。用户应加强信息安全及使用者资料的保护意识，要注意加强密码保护，以免遭致损失和骚扰。

            4、对于因不可抗力或本公司不能控制的原因（包括但不限于计算机病毒或黑客攻击、系统不稳定、用户不当使用账户、以及其他任何技术、互联网络、通信线路原因等）威胁到用户的计算机信息和数据的安全，造成影响服务的正常使用或其它缺陷等等，本公司无需承担任何责任。

            5、由于用户登录网站内容违法、不真实、不正当、侵犯第三方任何合法权益，或用户违反本协议项下的任何条款而给本公司或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。

            6、用户须明白，在使用本服务过程中存在有来自任何他人的包括威胁性的、诽谤性的、令人反感的或非法的内容或行为或对他人权利的侵犯（包括知识产权、名誉权、肖像权、姓名权等权利）的匿名或冒名的信息的风险，用户须自行承担以上风险，本公司和合作公司对本服务不作任何类型的担保，不论是明确的或隐含的，包括所有有关信息真实性、适商性、适于某一特定用途、所有权和非侵权性的默示担保和条件，对因此导致任何因用户不正当或非法使用服务产生的直接、间接、偶然、特殊及后续的损害，不承担任何责任。

            7、本公司需要定期或不定期地对Youla平台或相关设备进行检修或者维护，如因此类情况而造成服务在合理时间内中断，本公司无需承担任何责任，但本公司会尽量事先在Youla平台上进行通告。

            8、依据法律法规及本协议约定，本公司获得处理相关违规行为或违规内容的权利，该等权利不构成Youla平台的义务或承诺，本公司不能保证第一时间发现并处理违法违规行为或内容，但本公司会做到及时处理，对于平台中发生的违法违规行为及时解决。

            9、对于Youla平台向用户提供的下列产品或服务的质量缺陷及其引发的任何损失，本公司无需承担任何责任：

            （1）Youla平台向用户免费提供的服务；

            （2）Youla平台向用户赠送的任何产品或者服务。

            九、知识产权

            1.Youla软件相关内容（包括但不限于网页、文本、图片、音频、视频、图标、数据、源代码和其他所有信息）均由重庆月下童信息科技有限公司享有知识产权，未经重庆月下童信息科技有限公司事先书面同意，用户或其他任何人不得复制、改编、传播、公布、展示或以其他任何方式侵犯Youla软件的知识产权。

            2.除另有特别声明外，Youla平台提供相关服务时所依托的软件著作权、专利权及其他知识产权均归重庆月下童信息科技有限公司所有。

            3.Youla软件在服务中涉及的图形、文字或其组成，以及其他标志、服务名称（以下统称“Youla标识”），其著作权或商标权归重庆月下童信息科技有限公司所有。未经重庆月下童信息科技有限公司事先书面同意，用户不得将Youla标识以任何方式展示或使用或作其他处理，也不得向其他任何人表明用户有权展示、使用、或其他有权处理Youla标识的行为。

            4.对于经用户本人创作并上传到Youla的文本、图片、图形、音频和/ 或视频等，本公司保留对其网站所有内容进行实时监控的权利，并有权依其独立判断对任何违反本协议约定的作品实施删除。本公司对于删除用户作品引起的任何后果或导致用户的任何损失不负任何责任。

            十、适用法律和争议解决

            本协议的解释、效力及纠纷的解决，适用于中华人民共和国法律。若用户和本公司之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，纠纷或争议由重庆月下童信息科技有限公司住所地人民法院管辖。

            十一、其他规定

            1、本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。

            2、本协议中的标题仅为方便而设，在解释本协议时应被忽略。

            3、以上各项条款内容的最终解释权及修改权归本公司所有。

            十二、如何联系我们

            您可以通过以下方式与我们联系，我们将在1-15日内回复您的请求：

            1、如对本政策内容有任何疑问、意见或建议，您可以在Youla平台中“我的”页面设置中反馈处与我们联系。

            2、如发现个人信息可能被泄露，您可以拨打客服服务电话与我们联系。客服电话：13922120454。

            3、我们的注册地址为：重庆市北碚区施家梁镇桂和二路5栋1号1-143；个人信息保护相关负责人的联系方式为13922120454
            
            更新日期：2023.5.30`
